app/Models/CardapioMenuModel.php

SELECT *
FROM `Pratos`
---
    public function buscarPratos()
{
    return $this->db->table('Pratos')
                    ->select('*')
                    ->get()
                    ->getResult();