app/Models/ReportModel.php

SELECT SUM(COALESCE(p.valor, t.valor)) as valor, DATE(cv.data) as dtVenda, SUM(p.valor) as valorPromocao, COUNT(*) as qtdVendida
FROM `situacaoTicket` `st`
JOIN `ticket` `t` ON `t`.`situacaoTicket` = `st`.`idSituacaoTicket`
JOIN `compraVenda` `cv` ON `cv`.`idTicket` = `t`.`idTicket`
LEFT JOIN `promocoes` `p` ON `p`.`idpromocoes` = `t`.`idpromocao`
GROUP BY `dtVenda`
ORDER BY `qtdVendida` DESC
---
    public function reportData(){
        $db = \Config\Database::connect();

        // $query = $db->table('compraVenda')
        //             ->select('SUM(ticket.valor) as valor, DATE(compraVenda.data) as dtVenda, SUM(promocoes.valor) as valorPromocao, COUNT(*) as qtdVendida')
        //             ->join('ticket', 'ticket.idTicket = compraVenda.idTicket')
        //             ->join('situacaoTicket', 'situacaoTicket.idSituacaoTicket = ticket.situacaoTicket')
        //             ->join('promocoes', 'promocoes.idpromocoes = ticket.idpromocao', 'left')
        //             ->groupBy('dtVenda')
        //             ->orderBy('qtdVendida', 'DESC')
        //             ->get();

        $query = $db->table('situacaoTicket st')
                    ->select('SUM(COALESCE(p.valor, t.valor)) as valor')
                    ->select('DATE(cv.data) as dtVenda')
                    ->select('SUM(p.valor) as valorPromocao')
                    ->select('COUNT(*) as qtdVendida')
                    ->join('ticket t', 't.situacaoTicket = st.idSituacaoTicket')
                    ->join('compraVenda cv', 'cv.idTicket = t.idTicket')
                    ->join('promocoes p', 'p.idpromocoes = t.idpromocao', 'left')
                    ->groupBy('dtVenda')
                    ->orderBy('qtdVendida', 'desc')
                    ->get();