app/Models/StudentModel.php

    public function getTickets(){
        $db         = \Config\Database::connect();

        $user = session()->get('user');

        $query      = $db->table('compraVenda')
                    ->join('usuario', 'usuario.idUsuario = compraVenda.idUsuario')
                    ->join('ticket', 'ticket.idTicket = compraVenda.idTicket')
                    ->join('situacaoTicket','situacaoTicket.idSituacaoTicket = ticket.situacaoTicket')
                    ->where('usuario.idUsuario', $user->idUsuario)
                    ->orderBy('compraVenda.data','DESC')
                    ->get();
---
SELECT *
FROM `compraVenda`
JOIN `usuario` ON `usuario`.`idUsuario` = `compraVenda`.`idUsuario`
JOIN `ticket` ON `ticket`.`idTicket` = `compraVenda`.`idTicket`
JOIN `situacaoTicket` ON `situacaoTicket`.`idSituacaoTicket` = `ticket`.`situacaoTicket`
WHERE `usuario`.`idUsuario` = '1'
ORDER BY `compraVenda`.`data` DESC