app/Models/TicketsModel.php

SELECT *
FROM `promocoes`
WHERE `inicioPromocao` <= '2023-10-05'
AND `fimPromocao` >= '2023-10-05'
---
    public function getSales() {
        $db = \Config\Database::connect();

        $currentDate    = date('Y-m-d');

        $query          = $db->table('promocoes')
                        ->where('inicioPromocao <=', $currentDate)
                        ->where('fimPromocao >=', $currentDate)
                        ->get();

SELECT *
FROM `ticket`
WHERE `vencimento` >= '2023-10-26'
---
    public function getTickets(){
        $db = \Config\Database::connect();

        $currentDate        = date('Y-m-d');

        $query              = $db->table('ticket')
                            ->where('vencimento >=', $currentDate)
                            ->get();

INSERT INTO `compraVenda` (`data`, `idTicket`, `idUsuario`) VALUES ('2023-11-16 06:11:52', '1016', '10')
UPDATE `ticket` SET `situacaoTicket` = 1
WHERE `idTicket` = '1016'
---
    public function buyTicket($idUser, $idTicket){
        $db = \Config\Database::connect();

        $date = date('Y-m-d h:m:s');

        $data = [
            'data'          => $date,
            'idTicket'      => $idTicket,
            'idUsuario'     => $idUser
        ];

        $buyed                      = count($this->getBuyed());
        $quantitiesAllowedSale      = $this->getQuantities()[0];

        if( $buyed >= $quantitiesAllowedSale->quantidadePermitidaVenda){
            session()->setFlashdata('error', 'Usuário com limite máximo de tickets ativos!');

        } else {
            $builder = $db->table('compraVenda');
            $builder->insert($data);

            $dataTicket = [
                'situacaoTicket' => 1
            ];

            $builderTicket = $db->table('ticket');
            $builderTicket->where('idTicket', $idTicket);
            $builderTicket->set($dataTicket)->update();

SELECT *
FROM `compraVenda`
JOIN `ticket` ON `ticket`.`idTicket` = `compraVenda`.`idTicket`
WHERE `idUsuario` = '10'
AND `situacaoTicket` = 1
---
    public function getBuyed(){
        $db = \Config\Database::connect();

        $user = session()->get('user');

        $query = $db->table('compraVenda')
                ->join('ticket', 'ticket.idTicket = compraVenda.idTicket')
                ->where('idUsuario', $user->idUsuario)
                ->where('situacaoTicket', 1)
                ->get();

        $results = $query->getResult();

SELECT *
FROM `quantidadePermitida`
ORDER BY `data` DESC
 LIMIT 1
---
    public function getQuantities(){
        $db = \Config\Database::connect();

        $query = $db->table('quantidadePermitida')
                ->orderBy('data', 'desc')
                ->limit(1)
                ->get();


        $result = $query->getResult();

SELECT *
FROM `ticket`
WHERE `cod` = '6140923'
SELECT *
FROM `ticket`
WHERE `cod` = '4140923'
---
    public function getTicket($codTicket){
        $db = \Config\Database::connect();

        $query = $db->table('ticket')
                -> where('cod', $codTicket)
                ->get();

        $result = $query->getResult();

UPDATE `ticket` SET `situacaoTicket` = 4
WHERE `cod` = '6140923'
---
    public function validateTicket($codTicket){

        $db = \Config\Database::connect();

        $data = [
            'situacaoTicket' => 4
        ];

        $builder = $db->table('ticket');
        $builder->where('cod', $codTicket);
        $builder->set($data)->update();