app/Models/TicketsModel.php

    public function getTickets($top=0){
        $db = \Config\Database::connect();

        $currentDate        = date('Y-m-d');

        if($top == 0) {
            $query              = $db->table('ticket')
                                ->where('vencimento >=', $currentDate)
                                ->get();
        } else {
            $query              = $db->table('ticket')
                                ->where('vencimento >=', $currentDate)
                                ->where('situacaoTicket', 3)
                                ->limit($top)
                                ->get();
---
SELECT *
FROM `ticket`
WHERE `vencimento` >= '2023-11-16'
AND `situacaoTicket` = 3
 LIMIT 1

    public function getTicketsValidatedToday($idUser){
        $db = \Config\Database::connect();

        $date = date('Y-m-d');


        $query = $db->table('compraVenda')
                    ->join('ticket', 'ticket.idTicket = compraVenda.idTicket')
                    ->where('compraVenda.idUsuario', $idUser)
                    ->where('ticket.dataValidacao', $date)
                    ->get();
---
SELECT *
FROM `compraVenda`
JOIN `ticket` ON `ticket`.`idTicket` = `compraVenda`.`idTicket`
WHERE `compraVenda`.`idUsuario` = '1'
AND `ticket`.`dataValidacao` = '2023-10-05'